{
    "products": [
    {
    "productId": "1",
    "name": "Starlight-12 Hades",
    "price": 189,
    "url": "./images/Starlight-12Black.png",
    "description": "When it comes to mice, it is hard to beat the Medium Black Finalmouse Starlight-12 Hades mouse. The first quality about the mouse you might notice is its color and design: a sleek black with gold accents. When you pick up the Medium Black Finalmouse Starlight-12 Hades, you'll notice it is super lightweight, as it comes in at just about 47 grams. Impressively, Finalmouse didn't sacrifice performance when they created the beautifully designed and lightweight Medium Black Finalmouse Starlight-12 Hades. This mouse has faster latency than any other mouse, whether wired or wireless. And even though this mouse is for performance, you will not need to charge it very frequently. The Medium Black Finalmouse Starlight-12 Hades released in May of 2021 for $189."
    },
    {
    "productId": "2",
    "name": "Starlight-12 Ares",
    "price": 189,
    "url": "./images/Starlight-12Red.png",
    "description": "Play games on PC like never before with the Medium Red Finalmouse Starlight-12 Ares mouse. This red variant of the Legendary Finalmouse release has much to boast. Weighing just about 47 grams, it is incredibly light, but Finalmouse did not give up advanced technology for its lightweight. The Medium Red Finalmouse Starlight-12 Ares beats out all other mice when it comes to latency speeds and has great battery life. The Medium Red Finalmouse Starlight-12 Ares released in May of 2021 for $189."
    },
    {
    "productId": "3",
    "name": "Starlight-12 Zeus",
    "price": 189,
    "url": "./images/Starlight-12White.png",
    "description": "If you are ready to upgrade your gaming mouse, the Medium White Finalmouse Starlight-12 Zeus mouse is for you. Free from the constraints of a wire, this wireless mouse has faster latency than all other mice and has incredible battery life. With its super light magnesium alloy chassis, its construction is just as advanced as its wireless capabilities. And with its sleek white color, the Medium White Finalmouse Starlight-12 Zeus looks as good as it performs. The Medium White Finalmouse Starlight-12 Zeus released in May of 2021 for $189."
    },    {
    "productId": "4",
    "name": "Starlight-12 Achilles",
    "price": 189,
    "url": "./images/Starlight-12Gold.png",
    "description": "It makes sense that the Medium Gold Finalmouse Starlight-12 Achilles mouse is part of Finalmouse's Legendary Drop, as this mouse is truly legendary. The Medium Gold Finalmouse Starlight-12 Achilles is wireless and weighs only about 47 grams. Despite its light weight, this mouse brings the power, as it has a long-lasting battery life and is made from extremely durable magnesium alloy. The Medium Gold Finalmouse Starlight-12 Achilles released in May of 2021 with a retail price of $189."
    },    
    {
    "productId": "5",
    "name": "Starlight-12 Pegasus",
    "price": 189,
    "url": "./images/Starlight-12Pegasus.png",
    "description": "Take your PC gaming to the next level with the Finalmouse Starlight-12 Pegasus Wireless mouse (medium). Weighing in at 47 grams, the Starlight-12 Pegasus is one of the lightest mice in the Finalmouse catalog, ensuring lightning precision and accuracy in-game. According to Finalmouse, the mouse features a resolution (dpi) of up to 20,000, and an IPS of approximately 450+ with integrated illumination. Finalmouse estimates an average battery life of around 160 hours, or average use case of around 3 weeks of gaming. The Finalmouse Starlight-12 Pegasus (medium) is made by gamers, for gamers, engineered to be one of the best mice for eSports."
    },    
    {
    "productId": "6",
    "name": "Starlight-12 Phantom",
    "price": 189,
    "url": "./images/Starlight-12Phantom.png",
    "description": "The Finalmouse Starlight-12 Phantom Wireless Mouse (Medium) features a magnesium chassis with an Ultem base. The Ultem lets the wireless signal through, but is not as strong as the magnesium top. At approximately 47 grams, the Finalmouse Starlight-12 Phantom Wireless Mouse (Medium) provides more stability and control, with lighter and snappier clicks than its predecessors. The rechargeable Jaunch Lithium Ion battery lasts about 160 continuous hours, or about 3 weeks of average computer use. Built on a Nordic RF platform and using Godspeed Wireless technology, the Finalmouse Starlight-12 Phantom Wireless Mouse (Medium) offers next-gen performance."
    },    
    {
    "productId": "7",
    "name": "Starlight Pro Tenz Edition",
    "price": 189,
    "url": "./images/Starlight-12Tenz.png",
    "description": "The Starlight Pro Tenz edition utilizes a high end rechargable Jauch Lithium Ion battery. Due to the revolutionary engineering that went into the power optimization of the sensor, pcb, and firmware you can expect long durations without needing to charge. Continuous battery life is estimated at ~160 hours, average use case life is estimated at 3 weeks, below average use case life is estimated at 7 weeks, idle use case of ~16+ weeks."
    },    
    {
    "productId": "8",
    "name": "Starlight-12 Poseidon",
    "price": 189,
    "url": "./images/Starlight-12Blue.png",
    "description": "Precision, lightweight, and accuracy are all attributes of the Finalmouse Starlight-12 Poseidon (medium). The mouse is the final release of the collection inspired by the Greek gods, following the success of Zeus, Ares and Hades mice. The Finalmouse Starlight-12 Poseidon (medium) weighs only 47 grams, the perfect lightweight mouse for competitive and professional PC gamers. As Finalmouse previously stated on its website: lighter is better. \"Isaac Newton figured this out with his law of inertia. Force = Mass x Acceleration. The lighter the mouse, the faster you move to your target.\""
    },    
    {
    "productId": "9",
    "name": "The Last Legend Starlight Pro",
    "price": 189,
    "url": "./images/TheLastLegend.png",
    "description": "FinalMouse The Last Legend Starlight Pro Medium. The centerpiece of the Starlight-12 Collection by Finalmouse."
    },    
    {
    "productId": "10",
    "name": "Keychron Q6",
    "price": 215,
    "url": "./images/Keychron-Q6.png",
    "description": "Keychron Q6 is a premium full-size and all-metal mechanical keyboard. With its all-metal CNC machined body, a full-size layout, double-gasket design, QMK/VIA support, and knob option, the Q6 meets all your practical needs and gives you a high-end typing experience."
    },    
    {
    "productId": "11",
    "name": "Keychron K10",
    "price": 85,
    "url": "./images/Keychron-K10.png",
    "description": "The Keychron K10 is engineered to maximize your productivity with most popular full size layout with number pad. The hot-swappable option on Gateron G Pro Mechanical switches offers the freedom to easily personalize your typing experience without soldering."
    },    
    {
    "productId": "12",
    "name": "Apex Pro",
    "price": 180,
    "url": "./images/SteelSeries-Apex-Pro.png",
    "description": "The Apex Pro is the world's fastest and most advanced full-sized keyboard performs effortlessly for all undertakings, whether you need the fastest keystrokes in gaming to destroy the competition, or deliberate presses for typing accuracy – the power is yours to wield."
    },    
    {
    "productId": "13",
    "name": "NuPhy Air75",
    "price": 110,
    "url": "./images/NuPhy-Air75.png",
    "description": "NuPhy Air75 is an innovative 75% ultra-slim wireless mechanical keyboard. With the world’s thinnest PBT spherical keycap, low-latency 2.4G wireless connection, and hot-swappable function, Air75 aims to become the new standard for slim mechanical keyboards."
    },    
    {
    "productId": "14",
    "name": "RK61",
    "price": 50,
    "url": "./images/Royal-Kludge-RK61.png",
    "description": "RK61 is a ultra-compact layout keyboard with 61 keys. Concentrated all the key functions you need in minimalist design. Save more space for your mouse moving and neat the desktop. It’s most FPS gamers' choice for this 60% gaming keyboard."
    }, 
    {
    "productId": "15",
    "name": "GMMK Pro",
    "price": 170,
    "url": "./images/Glorious-GMMK-Pro.png",
    "description": "The GMMK Pro is an award-winning modular mechanical keyboard with enthusiast components and unmatched build quality. Fully customizable to your perfect look, sound, and feel."
    },
    {
    "productId": "16",
    "name": "Nova Pro",
    "price": 382,
    "url": "./images/Arctis-Nova-Pro.png",
    "description": "Ultimate clarity and sound quality come together in the Nova Pro Acoustic System, raising the bar for what audio in gaming means. Our audio engineers pushed the envelope for legendary performance with Premium High Fidelity Drivers, achieving sound purity unlike any other gaming headset."
    },
    {
    "productId": "17",
    "name": "HyperX™ Cloud Alpha",
    "price": 100,
    "url": "./images/Cloud-Alpha.png",
    "description": "Enhance your gaming experience with cleaner, smoother sound. The HyperX™ Cloud Alpha’s dual-chamber driver system separates the bass from the mids and highs, allowing them to be tuned individually for reduced distortion."
    },
    {
    "productId": "18",
    "name": "G535",
    "price": 130,
    "url": "./images/G535.png",
    "description": "G535 is designed for low-latency performance, freedom from wires and lasting comfort for all your gaming sessions. Enjoy advanced LIGHTSPEED wireless, 33-hour battery life,3May vary based on user and computing conditions. Battery life is based on headset volume set to 50%. and 40 mm drivers for crystal-clear and booming sound. Weighing just 236 grams with an adjustable headband and soft memory foam earpads to ensure all-day comfort."
    }
    ]
}